Revit 2027 API
IndexBuffer.IsValid Method
 Tests whether the buffer is valid for rendering.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
 True if the buffer is valid for rendering, false otherwise.
Remarks
 The buffers are internally associated with low-level graphics state and may become invalidated when the state changes. Therefore, an application should test each buffer for validity before submitting its contents for rendering. If the buffer becomes invalid, the application should re-create its contents and write them to a new buffer.
See Also
Reference
IndexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace